app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R') ORDER BY release_date
---
  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:order => :title}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:order => :release_date}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]

INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.create!(params[:movie])

SELECT "movies".* FROM "movies" WHERE (director = 'George Lucas' AND id != '1')
---
  def similar
    @movie = Movie.find params[:id]

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "movies" SET "director" = 'Ridley Scott', "updated_at" = '2013-10-25 18:28:44.268952' WHERE "movies"."id" = 3
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])